app/Controllers/Articles.php

SELECT *
FROM `articles`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `articles`
---
    public function view_all_articles()
    {
        $articleModel = new ArticleModel();
        $pager = \Config\Services::pager();
        $perPage = 10;
        $search = $this->request->getGet('search');
        $query = $articleModel->builder();

        $userRole = $_SESSION['role'] ?? null;

        if ($userRole === 'admin') {
            if (!empty($search)) {
                $articles = $articleModel->searchArticles($search, $perPage);
            } else {
                $articles = $articleModel->paginate($perPage);

SELECT *
FROM `articles`
WHERE `articles`.`id` = '66'
---
    public function show($id)
    {
        // $articleModel = new ArticleModel;
        // $commentTable = new commentTable;
        // $article = $articleModel->find($id);
        // return view('articles/show',['article'=>$article, 'articleId' => $id]);
        $articleModel = new ArticleModel();
        $commentTable = new CommentTable();

        $article = $articleModel->find($id);