app/Controllers/Home.php

SELECT *
FROM `articles`
WHERE `status` = 'publish'
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `articles`
WHERE `status` = 'publish'
---
    public function index()
    {
        $articleModel = new ArticleModel;
        $pager = \Config\Services::pager();
        $perPage = 10;
        $articles = $articleModel->where('status', 'publish')->paginate($perPage);